IDs = {'user1': [213, 213, 213, 15, 213],
        'user2': [54, 54, 119, 119, 119],
        'user3': [213, 98, 98, 35]}
GEO_LOGS = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Дели', 'Франция']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit4': ['Лиссабон', 'Франция']},
    {'visit5': ['Париж', 'Франция']},
    {'visit6': ['Лиссабон', 'Португалия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']}
]

QUERIES = [
    'смотреть сериалы онлайн',
    'новости спорта',
    'афиша кино',
    'курс доллара',
    'сериалы этим летом',
    'курс по питону',
    'сериалы про спорт',
    'надо больше слов в запросе',
    'чтобы проверить правильность программы',
    'вотъ',
    'а еще надо пустой запрос сделать',
    ''
    ]