FIXTURE_NONUNIQUE = [
    ([332, 211, 332, 332, 1, 2], [332, 211, 2, 1]),
    ([1, 2, 3, 4, 5, 5, 4, 3, 2, 1], [5, 4, 3, 2, 1])
]
FIXTURE_DICT_TO_LIST = [ 
    ({
        1:['abc', 'dce', 'whatever'],
        2:[1, 2, 3],
        3:['end']}, 
        ['abc', 'dce', 'whatever', 1, 2, 3, 'end']
    ),    
    ({
        'cityoftroy':['HOMM', 'with', 'cheats', '=', 'lame'],
        3:['third', 'is', 'the', 'best']},
        ['HOMM', 'with', 'cheats', '=', 'lame', 'third', 'is', 'the', 'best']
    )        
]
FIXTURE_GEO_LOGS = [
    ([
        {'visit1': ['Москва', 'Россия']},
        {'visit2': ['Дели', 'Франция']},
        {'visit3': ['Владимир', 'Россия']}
    ],
        'Франция',
    [
        {'visit2': ['Дели', 'Франция']}
    ]     
    ),
    ([  {'visit8': ['Тула', 'Россия']},
        {'visit9': ['Курск', 'Россия']},
        {'visit6': ['Лиссабон', 'Португалия']}
    ],    
        'Россия',
    [
        {'visit8': ['Тула', 'Россия']},
        {'visit9': ['Курск', 'Россия']}
    ]
    )
]
FIXTURE_QUERIES = [
    (
        4,
        [
            'смотреть сериалы онлайн',
            'новости спорта',
            'выучить питон за неделю',
            'курс доллара к рублю',
            'stack overflow python help',
            'курс по питону',
            'сериалы про спорт',
            'надо больше слов в запросе',
            'чтобы проверить правильность программы',
            'вотъ',
            'а еще надо пустой запрос сделать',
            ''
        ],
        4
    ),
    (
        2,
        [
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта',
            'новости спорта /'
        ],
        25
    )
]